In [1]:
import psycopg2
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
def get_engine(user, password, host, port, database):
    """
    Returns an engine to the database
    """
    return create_engine('postgresql://{}:{}@{}:{}/{}'.format(user, password, host, port, database))

engine = get_engine(user=input('Enter your username: '), 
                    password=input("enter password: "), 
                    host='localhost', 
                    port=5432, 
                    database=input("Enter database name: "))
print(engine)

Engine(postgresql://rob_the_programmer:***@localhost:5432/animalshelter)

In [3]:
query = "select * from persons;"
persons_df = pd.read_sql_query(query, engine)
persons_df.head()

,email,first_name,last_name,birth_date,address,state,city,zip_code
0,adam.brown@gmail.com,Adam,Brown,1984-12-22,41 Hill,California,Norwalk,90650
1,alan.cook@hotmail.com,Alan,Cook,None,115 Sunset,California,Inglewood,90301
2,albert.wood@gmail.com,Albert,Wood,1962-01-30,780 Sixth,California,Bell Gardens,90201
3,anna.thompson@hotmail.com,Anna,Thompson,1997-05-11,716 Meadow,California,Los Angeles,90032
4,anne.parker@icloud.com,Anne,Parker,1973-10-21,130 Eleventh,California,Carson,90248

In [4]:
query = "select * from animals;"
animals_df = pd.read_sql_query(query, engine)
animals_df.head()

,name,species,primary_color,implant_chip_id,breed,gender,birth_date,pattern,admission_date
0,Abby,Dog,Black,fdfdb6fe-3347-4e80-8c8a-2e3235c6d1de,None,F,1999-02-19,Tricolor,2016-07-19
1,Ace,Dog,Ginger,33d50c6b-9d2e-4eb1-8171-0466dee4f349,None,M,2005-12-19,Bicolor,2019-06-25
2,Angel,Dog,Brown,f0769a5e-1a11-49f1-ac80-3f40a32ea158,None,F,2001-09-19,Tuxedo,2017-02-04
3,April,Rabbit,Gray,ccfef7e8-6fad-4ba0-81ea-0611dd229e42,None,F,2005-01-27,Broken,2019-04-24
4,Archie,Cat,Ginger,970d7094-ab66-4dca-a0d1-0c16264989af,Persian,M,2009-08-26,Tricolor,2016-07-10

In [5]:
query = "select * from adoptions;"
adoptions_df = pd.read_sql_query(query, engine)
adoptions_df.head()

,name,species,adopter_email,adoption_date,adoption_fee
0,Abby,Dog,patrick.hughes@animalshelter.com,2018-08-30,58
1,Ace,Dog,justin.ruiz@hotmail.com,2019-10-26,68
2,Archie,Cat,patrick.hughes@animalshelter.com,2018-08-30,82
3,Bailey,Dog,wayne.turner@icloud.com,2019-07-26,50
4,Baloo,Rabbit,jesse.cox@yahoo.com,2017-12-16,58

In [6]:
query = "select * from staff;"
staff_df = pd.read_sql_query(query, engine)
staff_df.head()

                              email   hire_date
0   ashley.flores@animalshelter.com  2016-01-01
1     dennis.hill@animalshelter.com  2018-10-07
2    frances.hill@animalshelter.com  2016-01-01
3    gerald.reyes@animalshelter.com  2018-03-20
4  patrick.hughes@animalshelter.com  2018-12-15

In [7]:
query = "select * from staff_assignments;"
staff_assignments_df = pd.read_sql_query(query, engine)
staff_assignments_df.head()

                              email          role    assigned
0   ashley.flores@animalshelter.com  Veterinarian  2016-01-01
1     dennis.hill@animalshelter.com  Veterinarian  2018-10-07
2    frances.hill@animalshelter.com  Receptionist  2016-01-01
3    gerald.reyes@animalshelter.com     Assistant  2018-03-20
4  patrick.hughes@animalshelter.com  Receptionist  2018-12-15

In [8]:
query = "select * from staff_roles;"
staff_roles_df = pd.read_sql_query(query, engine)
staff_roles_df.head()

           role
0     Assistant
1       Janitor
2       Manager
3  Receptionist
4  Veterinarian

In [9]:
query = "select * from vaccinations;"
vaccinations_df = pd.read_sql_query(query, engine)
vaccinations_df.head()

,name,species,vaccination_time,vaccine,batch,comments,email
0,Abby,Dog,2017-04-19 09:01:00,Distemper Virus,N-178784096,None,ashley.flores@animalshelter.com
1,Abby,Dog,2018-04-19 10:44:00,Distemper Virus,L-107687717,None,wanda.myers@animalshelter.com
2,Angel,Dog,2017-05-04 10:38:00,Distemper Virus,L-353180534,None,wanda.myers@animalshelter.com
3,Angel,Dog,2018-05-04 09:47:00,Distemper Virus,A-271237673,None,wanda.myers@animalshelter.com
4,Angel,Dog,2017-05-04 12:49:00,Rabies,V-180603107,None,wanda.myers@animalshelter.com